import { TimePeriod } from '../../types/interfaces';

export const timePeriods: TimePeriod[] = [
    {
        period: [1987, 1991],
        topic: 'Кино',
        events: [
            {
                date: 1987,
                event: '"Хищник"/Predator — американский фантастический боевик, снятый Джоном Мактирнаном по сценарию братьев Томас'
            },
            {
                date: 1988,
                event: '«Кто подставил кролика Роджера»/Who Framed Roger Rabbit — американский комедийный анимационно-игровой фильм режиссёра Роберта Земекиса'
            },
            {
                date: 1989,
                event: '"Назад в будущее 2"/Back To The Future, Part II — научно-фантастический фильм режиссёра Роберта Земекиса по сценарию Боба Гейла, вторая часть трилогии "Назад в будущее"'
            },
            {
                date: 1990,
                event: 'Крепкий орешек 2/Die Hard 2 — американский боевик 1990-го года и вторая часть серии фильмов о полицейском Джоне Макклейне'
            },
            {
                date: 1991,
                event: '"Терминатор 2: Судный день"/Terminator 2: Judgment Day — американский научно-фантастический боевик режиссёра Джеймса Кэмерона'
            }
        ]
    },
    {
        period: [1992, 1997],
        topic: 'Литература',
        events: [
            {
                date: 1992,
                event: 'Нобелевская премия по литературе - Дерек Уоллкот "За блестящий образец карибского эпоса в 64 резделах"'
            },
            {
                date: 1994,
                event: '"Бессонница" - роман Стивена Кинга'
            },
            {
                date: 1995,
                event: 'Нобелевская премия по литературе - Шеймас Хини'
            },
            {
                date: 1996,
                event: 'Нобелевская премия по литературе — Вислава Шимборская, "За поэзию, которая с предельной точностью описывает исторические и биологические явления в контексте человеческой реальности"'
            },
            {
                date: 1997,
                event: 'Нобелевская премия по литературе — Дарио Фо, "Наследуя средневековых шутов, порицает власть и авторитет и защищает достоинство угнетённых"'
            }
        ]
    },
    {
        period: [1999, 2004],
        topic: 'Театр',
        events: [
            {
                date: 1999,
                event: 'Премьера балета "Золушка" в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона'
            },
            {
                date: 2000,
                event: 'Возобновлено издание журнала "Театр"'
            },
            {
                date: 2002,
                event: 'Премьера трилогии Тома Стоппарда "Берег утопии", Королевский национальный театр, Лондон'
            },
            {
                date: 2003,
                event: 'В Венеции после восьмилетней реставрации постановкой оперы Джузеппе Верди "Травиата" открылся театр "Ла Фениче", пострадавший в пожаре 1996 года'
            },
            {
                date: 2004,
                event: '8 октября в Театре на покровке состоялась премьера спектакля "Последние страницы из дневника женщины" по мотивам одноимённой повести В. Брюсова — пронзительная история о любви'
            }
        ]
    },
    {
        period: [2005, 2010],
        topic: 'Космос',
        events: [
            {
                date: 2005,
                event: 'Зонд «Гюйгенс» вошёл в атмосферу Титана, совершил мягкую посадку на поверхность и передал снимки и другие данные через аппарат «Кассини» на Землю'
            },
            {
                date: 2007,
                event: 'Открытие планеты Глизе 581c'
            },
            {
                date: 2008,
                event: 'Автоматическая межпланетная станция MESSENGER сделала первый из трёх планируемых облётов Меркурия. Подлетев на расстояние 200 километров, она передала множество снимков планеты'
            },
            {
                date: 2009,
                event: 'Был запущен российский спутник «Коронас-ФОТОН». Он стал третьим спутником, запущенным в рамках программы КОРОНАС (Комплексные орбитальные околоземные наблюдения активности Солнца)'
            },
            {
                date: 2010,
                event: 'Орбитальный телескоп «Кеплер» открыл свои первые пять экзопланет: Kepler-4 b, Kepler-5 b, Kepler-6 b, Kepler-7 b, Kepler-8 b'
            }
        ]
    },
    {
        period: [2015, 2022],
        topic: 'Наука',
        events: [
            {
                date: 2015,
                event: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                event: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                date: 2017,
                event: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2018,
                event: 'Официально подтверждено открытие нового класса антибиотиков Odilorhabdin, анонсированное в 2013 году, а также описан механизм его действия'
            },
            {
                date: 2019,
                event: 'Google объявил о создании 53-кубитного квантового компьютера'
            },
            {
                date: 2020,
                event: 'При анализе мурчисонского метеорита обнаружены древнейшие на Земле частицы вещества, появившиеся когда ещё не существовало Солнечной системы'
            },
            {
                date: 2021,
                event: 'Учёные создали гибридные эмбрионы человека и обезьяны'
            },
            {
                date: 2022,
                event: 'Найдено вулканическое озеро с условиями жизни как на Марсе. В вулканическом озере вулкана Поас обитает единственный вид бактерий — Acidiphilium. Такое открытие наглядно даёт понять, как на Марсе может существовать жизнь'
            }
        ]
    }
];

export const timePeriods2: TimePeriod[] = [
    {
        period: [1987, 1991],
        topic: 'Кино',
        events: [
            {
                date: 1987,
                event: '"Хищник"/Predator — американский фантастический боевик, снятый Джоном Мактирнаном по сценарию братьев Томас'
            },
            {
                date: 1988,
                event: '«Кто подставил кролика Роджера»/Who Framed Roger Rabbit — американский комедийный анимационно-игровой фильм режиссёра Роберта Земекиса'
            },
            {
                date: 1989,
                event: '"Назад в будущее 2"/Back To The Future, Part II — научно-фантастический фильм режиссёра Роберта Земекиса по сценарию Боба Гейла, вторая часть трилогии "Назад в будущее"'
            },
            {
                date: 1990,
                event: 'Крепкий орешек 2/Die Hard 2 — американский боевик 1990-го года и вторая часть серии фильмов о полицейском Джоне Макклейне'
            },
            {
                date: 1991,
                event: '"Терминатор 2: Судный день"/Terminator 2: Judgment Day — американский научно-фантастический боевик режиссёра Джеймса Кэмерона'
            }
        ]
    },
    {
        period: [1992, 1997],
        topic: 'Литература',
        events: [
            {
                date: 1992,
                event: 'Нобелевская премия по литературе - Дерек Уоллкот "За блестящий образец карибского эпоса в 64 резделах"'
            },
            {
                date: 1994,
                event: '"Бессонница" - роман Стивена Кинга'
            },
            {
                date: 1995,
                event: 'Нобелевская премия по литературе - Шеймас Хини'
            },
            {
                date: 1997,
                event: '-'
            }
        ]
    },
    {
        period: [2005, 2010],
        topic: 'Космос',
        events: [
            {
                date: 2005,
                event: 'Зонд «Гюйгенс» вошёл в атмосферу Титана, совершил мягкую посадку на поверхность и передал снимки и другие данные через аппарат «Кассини» на Землю'
            },
            {
                date: 2007,
                event: 'Открытие планеты Глизе 581c'
            },
            {
                date: 2008,
                event: 'Автоматическая межпланетная станция MESSENGER сделала первый из трёх планируемых облётов Меркурия. Подлетев на расстояние 200 километров, она передала множество снимков планеты'
            },
            {
                date: 2009,
                event: 'Был запущен российский спутник «Коронас-ФОТОН». Он стал третьим спутником, запущенным в рамках программы КОРОНАС (Комплексные орбитальные околоземные наблюдения активности Солнца)'
            },
            {
                date: 2010,
                event: 'Орбитальный телескоп «Кеплер» открыл свои первые пять экзопланет: Kepler-4 b, Kepler-5 b, Kepler-6 b, Kepler-7 b, Kepler-8 b'
            }
        ]
    },
    {
        period: [2015, 2022],
        topic: 'Наука',
        events: [
            {
                date: 2015,
                event: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                event: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                date: 2017,
                event: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2018,
                event: 'Официально подтверждено открытие нового класса антибиотиков Odilorhabdin, анонсированное в 2013 году, а также описан механизм его действия'
            },
            {
                date: 2019,
                event: 'Google объявил о создании 53-кубитного квантового компьютера'
            },
            {
                date: 2020,
                event: 'При анализе мурчисонского метеорита обнаружены древнейшие на Земле частицы вещества, появившиеся когда ещё не существовало Солнечной системы'
            },
            {
                date: 2021,
                event: 'Учёные создали гибридные эмбрионы человека и обезьяны'
            },
            {
                date: 2022,
                event: 'Найдено вулканическое озеро с условиями жизни как на Марсе. В вулканическом озере вулкана Поас обитает единственный вид бактерий — Acidiphilium. Такое открытие наглядно даёт понять, как на Марсе может существовать жизнь'
            }
        ]
    }
];